{
  "pageRefs": ["meow", "woof"],
  "socials": ["linkedin", "github", "email"],
  "career": [
    {
      "dates": "Jan. 2022 - Jun. 2024",
      "time": "2.5 years",
      "title": "Software Engineer",
      "company": "Lumen Learning",
      "tools": ["JavaScript", "Vue", "CSS", "Typescript", "React", "Storybook"],
      "description": "Primarily worked on the Frontend implementing designs into code for reusable functions and features in Vue and React across multiple products. Worked closely with cross-function teams, developers, back end, designers, product managers to implement new designs. Made new greenfield product for use with internal CMS systems."
    },
    {
      "dates": "Dec. 2020 - Jan. 2022",
      "time": "1.2 years",
      "title": "Full Stack Developer",
      "company": "Vanguard",
      "tools": ["JavaScript", "Java", "AngularJS", "Cypress", "JUnit/Jest"],
      "description": "Primarily worked as a Full Stack developer maintaining legacy codes. Followed the Agile/Lean methodology. Analyzed and identified areas for test automation by implementing stories."
    },
    {
      "dates": "Feb. 2020 - Nov. 2020",
      "time": "10 months",
      "title": "Salesforce Developer",
      "company": "Vanguard",
      "tools": ["Salesforce", "MongoDB", "Express", "AngularJS", "NodeJS"],
      "description": "Analyzed and identified areas for improvement to organization's Salesforce Security Model. Worked with internal international teams to determine and configure desired Salesforce interaction. During this time I mentored and advised an IT intern project team that used MEAN stack structure for an internal application development."
    },
    {
      "dates": "Jul. 2019 - Feb. 2020",
      "time": "8 months",
      "title": "Technology Leadership Program",
      "company": "Vanguard",
      "tools": [
        "HTML",
        "CSS",
        "JavaScript",
        "Public Speaking",
        "Project Planning"
      ],
      "description": "Leadership focused training in Technology. Highly focused technical development training in full stack development, web accessibility, and implemented a prototype internal application for company wide usage. Engaged in specialized training to develop business and leadership abilities including but not limited to: project presentation, business negotiations, public speaking, interpersonal skills, and project planning."
    }
  ],
  "aboutMe": [
    "I'm a Software Engineer that loves to bring ideas to life since 2019.\n\n",
    "\"Form follows function\" - Louis Sullivan, an American architect.\n",
    "This quote encapsulate my approach to implementation. Establishing function is the start of a great foundation; at this point in technology design is limited by our imagination.\n\n",
    "\"Coding is a form of art where the tools are constantly changing and new mediums are created every day.\" - a quote by me, actually, I'm not sure, I've lived on the internet for so long I don't know what's original anymore... ☺"
  ]
}
